Revit 2024 API
CurveLoop.NumberOfCurves Method
 Returns the number of curves in the curve loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.1
Syntax
C#
public int NumberOfCurves()
Visual Basic
Public Function NumberOfCurves As Integer
Visual C++
public:
int NumberOfCurves()
Return Value
 The number of curves in the curve loop.
See Also
CurveLoop Class
Autodesk.Revit.DB Namespace